_posts/2020-09-04-blogging-con-emacs-y-org-mode.html
---
layout: post
title: "Blogging con Emacs y org-mode"
date: 2020-09-04
tags: [blog, emacs]
---

<p>
Si el <i>Hola Mundo!</i> de la programación web es armar un blog, el <i>Hola Mundo!</i> de los posts es aquel que describe cómo se implementó ese blog.
En este caso no hay mucho para decir sobre la implementación —todo el trabajo pesado lo hacen Jekyll y Github Pages—, pero sí tuve que
invertir algo de tiempo preparando mi editor para el proceso de escritura y publicación.
</p>

<p>
Una de las razones por las que armé un nuevo blog es que trabajar con WordPress me daba escalofríos. Quería control de versiones para mis posts, tenerlos en GitHub en algún formato independiente de la plataforma, y, lo más importante, poder escribir en Emacs, el mismo editor que uso cotidianamente para programar. En particular, me interesaba usar <a href="https://orgmode.org/">org-mode</a> como lenguaje de markup. El objetivo es alcanzar un ciclo virtuoso (?) en el que escribo más seguido, aprendo más sobre org-mode y mejoro mi configuración de Emacs en el camino.
</p>

<div id="outline-container-org693d31e" class="outline-2">
<h2 id="org693d31e">Setup</h2>
<div class="outline-text-2" id="text-org693d31e">
<p>
Ya decidido a usar Emacs y org-mode, me pareció razonable buscar cómo integrarlos con Jekyll y Github Pages, para ahorrarme el trabajo y el costo de hosting y configuración del blog. Encontré <a href="https://carl.ac/blogging-with-emacs-org-github-pages/">este post</a>, que sigue un razonamiento muy parecido al mío, y lo usé como guía. Adicionalmente, la documentación de org-mode tiene <a href="https://orgmode.org/worg/org-tutorials/org-jekyll.html">un tutorial</a> dedicado específicamente a este escenario.
</p>

<p>
Siguiendo el ejemplo de aquel post, hice un fork de <a href="https://beautifuljekyll.com/">BeautifulJekyll</a>,
un template pensado para GitHub Pages que resuelve la mayoría de las necesidades básicas de un blog (layout, links, comentarios, analytics, etc.).
</p>

<p>
Para poder producir posts, necesitaba generar HTML que sea "Jekyll-friendly"<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. org-mode incluye <a href="https://orgmode.org/org.html#Exporting">funcionalidad de exportación</a> (convertir documentos org a otros formatos como LaTeX, markdown y html) y <a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">publishing</a> (exportar jerarquías de documentos relacionados o "proyectos"). Lo único que hace falta en este caso es declarar un proyecto que indique de dónde se leen los archivos .org y en dónde hay que guardar los .html exportados:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> org-publish-project-alist
      '<span style="color: #7388D6;">(</span><span style="color: #909183;">(</span><span style="color: #008000;">"blog"</span>
         <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Path to org files.</span>
         <span style="color: #006FE0;">:base-directory</span> <span style="color: #008000;">"~/dev/facundoolano/facundoolano.github.io/org"</span>
         <span style="color: #006FE0;">:base-extension</span> <span style="color: #008000;">"org"</span>

         <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Path to Jekyll Posts</span>
         <span style="color: #006FE0;">:publishing-directory</span> <span style="color: #008000;">"~/dev/facundoolano/facundoolano.github.io"</span>
         <span style="color: #006FE0;">:recursive</span> t
         <span style="color: #006FE0;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #006FE0;">:headline-levels</span> 4
         <span style="color: #006FE0;">:html-extension</span> <span style="color: #008000;">"html"</span>
         <span style="color: #006FE0;">:body-only</span> t<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Si bien teóricamente uno no necesita nada más que pushear cambios al repositorio para publicar en GitHub Pages, resulta más práctico tener Jekyll instalado localmente para previsualizar los posts antes de publicarlos. Instalé todo lo necesario así:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ asdf install ruby 2.7.1
$ asdf local ruby 2.7.1
$ gem install bundler jekyll
$ bundle install
</pre>
</div>
</div>
</div>


<div id="outline-container-org23917f6" class="outline-2">
<h2 id="org23917f6">Workflow</h2>
<div class="outline-text-2" id="text-org23917f6">
<p>
Para convertir un archivo de markdown, o en mi caso, de org-mode, en un post de Jekyll, hacen falta dos cosas: 1. prefijar el nombre del archivo con un timestamp (e.g. <code>2020-09-02-blogging-con-emacs-y-org-mode</code>) y 2. agregarle un encabezado con metadata:
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #BA36A5;">layout</span>: post
<span style="color: #BA36A5;">title</span>: <span style="color: #008000;">"Blogging con Emacs y org-mode"</span>
<span style="color: #BA36A5;">date</span>: 2020-09-04
<span style="color: #BA36A5;">tags</span>: [blog, emacs]
<span style="color: #8D8D84; font-style: italic;">---</span>
</pre>
</div>

<p>
Para automatizar esta tarea frecuente, escribí este comando (partiendo de lo que encontré <a href="https://www.dougwoos.com/2013/12/24/posting-to-jekyll-with-emacs.html">acá</a>):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-blog-new-post</span> <span style="color: #7388D6;">(</span>title<span style="color: #7388D6;">)</span>
  <span style="color: #036A07;">"Create a new org-file for a blog post as expected by Jekyll with TITLE."</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"MPost title: "</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>slug <span style="color: #907373;">(</span>sluggify title<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>date <span style="color: #907373;">(</span>current-time<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>find-file <span style="color: #709870;">(</span>concat <span style="color: #907373;">(</span>projectile-project-root<span style="color: #907373;">)</span> <span style="color: #008000;">"org/_posts/"</span>
                       <span style="color: #907373;">(</span>format-time-string <span style="color: #008000;">"%Y-%m-%d"</span><span style="color: #907373;">)</span> <span style="color: #008000;">"-"</span> slug
                       <span style="color: #008000;">".org"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"#+BEGIN_EXPORT html\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"---\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"layout: post\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"title: \""</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>insert title<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>insert <span style="color: #008000;">"\"\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"date: "</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>insert <span style="color: #709870;">(</span>format-time-string <span style="color: #008000;">"%Y-%m-%d %H:%M:%S"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>insert <span style="color: #008000;">"\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"tags: []\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"---\n"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert <span style="color: #008000;">"#+END_EXPORT\n\n"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
También agregué un comando para actualizar la fecha del post en el nombre y el encabezado del archivo (más para practicar emacs-lisp que por necesidad, si vamos a ser honestos):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-blog-reset-date</span> <span style="color: #7388D6;">(</span><span style="color: #7388D6;">)</span>
  <span style="color: #036A07;">"Prompt for a new blog post date and set it in the filename and the Jekyll \</span>
<span style="color: #036A07;">header."</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>s-contains? <span style="color: #008000;">"org/_posts/"</span> <span style="color: #907373;">(</span>pwd<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"Not visiting a blog buffer"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>date <span style="color: #6276BA;">(</span>read-from-minibuffer <span style="color: #008000;">"Post date: "</span> <span style="color: #858580;">(</span>format-time-string <span style="color: #008000;">"%Y-%m-%d"</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>filename <span style="color: #6276BA;">(</span>buffer-name<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>new-name <span style="color: #6276BA;">(</span>concat date <span style="color: #858580;">(</span>substring filename 10<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>rename-file filename new-name t<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>set-visited-file-name new-name t t<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">save-excursion</span>
        <span style="color: #907373;">(</span>goto-char <span style="color: #6276BA;">(</span>point-min<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>re-search-forward <span style="color: #008000;">"^date: .*$"</span> nil t<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>replace-match <span style="color: #6276BA;">(</span>concat <span style="color: #008000;">"date: "</span> date<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Para exportar el html uso <code>org-publish-current-project</code> y para ver el post localmente corro <code>bundle exec jekyll serve</code>.
</p>

<ul class="org-ul">
<li><a href="https://raw.githubusercontent.com/facundoolano/facundoolano.github.io/master/org/_posts/2020-08-31-la-magia-de-los-namespaces.org">Así</a> se ve el archivo .org de un post.</li>
<li><a href="https://github.com/facundoolano/facundoolano.github.io/blob/master/_posts/2020-08-31-la-magia-de-los-namespaces.html">Así</a> queda el HTML exportado.</li>
<li><a href="https://github.com/facundoolano/emacs.d/blob/master/modules/facundo-blog.el">Esta</a> es la sección relevante de mi configuración de Emacs.</li>
</ul>

<br>
</div>
</div>
<div id="footnotes">
<!--h2 class="footnotes">Nota al pie de p&aacute;gina: </h2-->
<h3 class="footnotes">Notas: </h3>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Alternativamente podría exportar de org a markdown, formato que Jekyll también soporta, pero es algo que todavía no probé.
</p></div></div>


</div>
</div>
